bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_pds.c
/**
  ******************************************************************************
  * @file    bl702l_pds.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl702l.h"
#include "bl702l_pds.h"
#include "bl702l_hbn.h"
#include "bl702l_ef_cfg.h"

/** @addtogroup  BL702L_Peripheral_Driver
 *  @{
 */

/** @addtogroup  PDS
 *  @{
 */

/** @defgroup  PDS_Private_Macros
 *  @{
 */

/*@} end of group PDS_Private_Macros */

/** @defgroup  PDS_Private_Types
 *  @{
 */

/*@} end of group PDS_Private_Types */

/** @defgroup  PDS_Private_Variables
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *pdsIntCbfArra[PDS_INT_MAX] = { NULL };
#endif

/*@} end of group PDS_Private_Variables */

/** @defgroup  PDS_Global_Variables
 *  @{
 */

/*@} end of group PDS_Global_Variables */

/** @defgroup  PDS_Private_Fun_Declaration
 *  @{
 */

/*@} end of group PDS_Private_Fun_Declaration */

/** @defgroup  PDS_Private_Functions
 *  @{
 */

/*@} end of group PDS_Private_Functions */

/** @defgroup  PDS_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  set gpio pad pull type in pds
 *
 * @param  pin: gpio type
 * @param  cfg: pull up en & pull down en & ie en & oe en
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_Type pin, PDS_GPIO_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    CHECK_PARAM(IS_PDS_GPIO_TYPE(pin));

    /* pu/pd/ie config */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_PU_SET);
    if (cfg->pu_en) {
        tmpVal |= (1 << pin);
    } else {
        tmpVal &= ~(1 << pin);
    }
    BL_WR_REG(PDS_BASE, PDS_GPIO_PU_SET, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_PD_SET);
    if (cfg->pd_en) {
        tmpVal |= (1 << pin);
    } else {
        tmpVal &= ~(1 << pin);
    }
    BL_WR_REG(PDS_BASE, PDS_GPIO_PD_SET, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_IE_SET);
    if (cfg->ie_en) {
        tmpVal |= (1 << pin);
    } else {
        tmpVal &= ~(1 << pin);
    }
    BL_WR_REG(PDS_BASE, PDS_GPIO_IE_SET, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_OE_SET);
    if (cfg->oe_en) {
        tmpVal |= (1 << pin);
    } else {
        tmpVal &= ~(1 << pin);
    }
    BL_WR_REG(PDS_BASE, PDS_GPIO_OE_SET, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set gpio pad value in pds
 *
 * @param  pad: gpio type
 * @param  val: GPIO value
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_GPIO_Write(PDS_GPIO_GROUP_SET_Type grp, uint32_t val)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);

    if (val > 0) {
        tmpVal |= (1 << grp);
    } else {
        tmpVal &= ~(1 << grp);
    }
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set gpio pad int mask type in pds
 *
 * @param  pad: gpio type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_GPIO_Pad_IntMask(PDS_GPIO_GROUP_SET_Type grp, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t tmpValMask;

    CHECK_PARAM(IS_PDS_GPIO_GROUP_SET_TYPE(grp));

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpValMask = BL_GET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_GPIO_SET_INT_MASK);
    if (intMask) {
        tmpValMask |= (1 << grp);
    } else {
        tmpValMask &= ~(1 << grp);
    }
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_GPIO_SET_INT_MASK, tmpValMask);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set gpio pad trig type in pds
 *
 * @param  set: set type
 * @param  trig: trig type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_GPIO_Pad_IntMode(PDS_GPIO_GROUP_SET_Type grp, PDS_GPIO_INT_TRIG_Type trig)
{
    uint32_t tmpVal = 0;

