bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_pds.c
    CHECK_PARAM(IS_PDS_GPIO_GROUP_SET_TYPE(grp));
    CHECK_PARAM(IS_PDS_GPIO_INT_TRIG_TYPE(trig));

    tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_INT_SET);
    tmpVal &= ~(0xF << (grp << 2));
    tmpVal |= (trig << (grp << 2));
    BL_WR_REG(PDS_BASE, PDS_GPIO_INT_SET, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set gpio pad int clear in pds
 *
 * @param  set: set type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_GPIO_Pad_IntClr(PDS_GPIO_GROUP_SET_Type grp)
{
    uint32_t tmpVal = 0;
    uint32_t offset = 0;

    CHECK_PARAM(IS_PDS_GPIO_INT_SET_TYPE(grp));

    offset = grp + PDS_CR_PDS_GPIO0_SET_INT_CLR_POS;

    /* pds_gpio_setx_int_clr = 0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpVal &= ~(1 << offset);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    /* pds_gpio_setx_int_clr = 1 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpVal |= (1 << offset);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    /* pds_gpio_setx_int_clr = 0 */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpVal &= ~(1 << offset);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set PDS gpio interrupt clear
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_All_GPIO_IntClear(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpVal &= ~(0xFF << PDS_CR_PDS_GPIO0_SET_INT_CLR_POS);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpVal |= (0xFF << PDS_CR_PDS_GPIO0_SET_INT_CLR_POS);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN);
    tmpVal &= ~(0xFF << PDS_CR_PDS_GPIO0_SET_INT_CLR_POS);
    BL_WR_REG(PDS_BASE, PDS_CFG_PDS_KEY_SCAN, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get gpio pad int status
 *
 * @param  pad: gpio type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Sts_Type ATTR_TCM_SECTION PDS_Get_GPIO_Pad_IntStatus(PDS_GPIO_Type pin)
{
    CHECK_PARAM(IS_PDS_GPIO_TYPE(pin));

    return (BL_RD_REG(PDS_BASE, PDS_GPIO_STAT) & (1 << pin)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  set flash pad pull none
 *
 * @param  pinCfg: flash pin type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_Flash_Pad_Pull_None(uint8_t pinCfg)
{
    PDS_GPIO_Cfg_Type pds_io_cfg = {
        .pd_en = 0,
        .pu_en = 0,
        .ie_en = 0,
        .oe_en = 0,
    };

    if (pinCfg == SF_CTRL_SEL_EXTERNAL_FLASH) {
        PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_PIN_23, &pds_io_cfg);
        PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_PIN_24, &pds_io_cfg);
        PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_PIN_25, &pds_io_cfg);
        PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_PIN_26, &pds_io_cfg);
        PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_PIN_27, &pds_io_cfg);
        PDS_Set_GPIO_Pad_Cfg(PDS_GPIO_PIN_28, &pds_io_cfg);
    } else {
        return INVALID;
    }

    return SUCCESS;
}
/****************************************************************************/ /**
 * @brief  set flash pad pull none
 *
 * @param  pinCfg: flash pin type
 *
 * @return SUCCESS or ERROR
 *
 * @note ext_flash need call this function after pds mode
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Set_Flash_Pad_Pull_None_Fast(uint8_t pinCfg)
{
    uint32_t tmpVal;

    if (pinCfg == SF_CTRL_SEL_EXTERNAL_FLASH) {
        /* pd config */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_PD_SET);
        /* GPIO23~28 [23]~[28] = 0 */
        tmpVal &= ~(0x1F800000);
        BL_WR_REG(PDS_BASE, PDS_GPIO_PD_SET, tmpVal);

        /* pu config */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_PU_SET);
        /* GPIO23~28 [23]~[28] = 0 */
        tmpVal &= ~(0x1F800000);
        BL_WR_REG(PDS_BASE, PDS_GPIO_PU_SET, tmpVal);

        /* ie config */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_IE_SET);
        /* GPIO23~28 [23]~[28] = 0 */
        tmpVal &= ~(0x1F800000);
        BL_WR_REG(PDS_BASE, PDS_GPIO_IE_SET, tmpVal);

        /* oe config */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_GPIO_OE_SET);
        /* GPIO23~28 [23]~[28] = 0 */
        tmpVal &= ~(0x1F800000);
        BL_WR_REG(PDS_BASE, PDS_GPIO_OE_SET, tmpVal);
    } else {
        return INVALID;
    }
    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Disable PDS GPIO Keep
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Disable_GPIO_Keep(void)
{
    uint32_t tmpVal = 0;

    /* PDS_IO keep disable */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_GPIO_ISO_MODE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_GPIO_KEEP_EN);
    /* don't entry PDS */
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_START_PS);
    BL_WR_REG(PDS_BASE, PDS_CTL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enabel PDS GPIO Keep
 *
 * @param  keepSel:
 * @return SUCCESS
 *
*******************************************************************************/
__WEAK
BL_Err_Type ATTR_TCM_SECTION PDS_Enable_PDS_Pad_Keep(uint32_t keepSel)
{
    uint32_t tmpVal = 0;

    /* PDS_IO keep disable */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_CR_PDS_GPIO_ISO_MODE);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_CR_SW_GPIO_ISO_MODE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_GPIO_KEEP_EN,keepSel);
    /* don't entry PDS */
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_START_PS);
    BL_WR_REG(PDS_BASE, PDS_CTL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable power down sleep
 *
 * @param  cfg: power down sleep configuration 1
 * @param  cfg4: power down sleep configuration 2
 * @param  pdsSleepCnt: power down sleep count cycle
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt)
{
    uint32_t tmpVal = 0;
    uint32_t valLow = 0, valHigh = 0;
    uint64_t val;

    /* PDS sleep time 1~PDS_WARMUP_LATENCY_CNT <=> error */
    /* PDS sleep time >PDS_WARMUP_LATENCY_CNT <=> correct */
    if ((pdsSleepCnt) && (pdsSleepCnt <= PDS_WARMUP_LATENCY_CNT)) {
        return ERROR;
    } else if (pdsSleepCnt > PDS_WARMUP_LATENCY_CNT) {
        HBN_Get_RTC_Timer_Val(&valLow, &valHigh);
        val = valLow + ((uint64_t)valHigh << 32);
        val += pdsSleepCnt - PDS_WARMUP_LATENCY_CNT;
        HBN_Set_RTC_Timer(HBN_RTC_INT_DELAY_0T, val & 0xffffffff, val >> 32, HBN_RTC_COMP_BIT0_39);
        HBN_Enable_RTC_Counter();
    } else {
        /* PDS sleep time 0 ,means mask pds_timer wakeup  */
    }

    /* PDS_CTL4 config */
    BL_WR_REG(PDS_BASE, PDS_CTL4, *(uint32_t *)cfg4);

    /* PDS_CTL config */
    if (cfg->pdsStart) {
        /* clear pds int */
        tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
        tmpVal = BL_SET_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
        BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

        tmpVal = BL_RD_REG(PDS_BASE, PDS_INT);
        tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_CR_PDS_INT_CLR);
        BL_WR_REG(PDS_BASE, PDS_INT, tmpVal);

        BL_WR_REG(PDS_BASE, PDS_CTL, (*(uint32_t *)cfg & ~(1 << 0)));
        BL_WR_REG(PDS_BASE, PDS_CTL, (*(uint32_t *)cfg | (1 << 0)));
    } else {
        BL_WR_REG(PDS_BASE, PDS_CTL, *(uint32_t *)cfg);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power down sleep force configure
 *
 * @param  cfg2: power down sleep force configuration 1
 * @param  cfg3: power down sleep force configuration 2
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3)
{
    /* PDS_CTL2 config */
    BL_WR_REG(PDS_BASE, PDS_CTL2, *(uint32_t *)cfg2);

    /* PDS_CTL3 config */
    BL_WR_REG(PDS_BASE, PDS_CTL3, *(uint32_t *)cfg3);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power down sleep ram configure
 *
 * @param  ramCfg: power down sleep force ram configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION PDS_RAM_Config(PDS_RAM_CFG_Type *ramCfg)
{
    if (NULL == ramCfg) {
        return ERROR;
    }

