bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_pds.c
#if 0
/****************************************************************************/ /**
 * @brief  PDS Auto mode wake up counter config
 *
 * @param  sleepDuration: sleep time, total pds = sleep_duration + max_warmup_cnt (32K clock cycles),
 *                        recommend maxWarmCnt*N+2
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION PDS_Auto_Time_Config(uint32_t sleepDuration)
{
    /* PDS_TIME1 */
    BL_WR_REG(PDS_BASE, PDS_TIME1, sleepDuration);
}
#endif
#endif
/****************************************************************************/ /**
 * @brief  PDS Auto mode config and enable
 *
 * @param  powerCfg: PDS Auto mode power domain config
 * @param  normalCfg: PDS Auto mode power normal config
 * @param  enable: PDS Auto mode Enable or Disable
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION PDS_Auto_Enable(PDS_AUTO_POWER_DOWN_CFG_Type *powerCfg, PDS_AUTO_NORMAL_CFG_Type *normalCfg, BL_Fun_Type enable)
{
    uint32_t pdsCtl = 0;

    CHECK_PARAM(IS_PDS_LDO_VOLTAGE_TYPE(normalCfg->vddcoreVol));

    /* power config */
    pdsCtl |= (powerCfg->mbgPower << 31) |
              (powerCfg->ldo18rfPower << 30) |
              (powerCfg->sfregPower << 29) |
              (powerCfg->pllPower << 28) |
              (powerCfg->cpu0Power << 19) |
              (powerCfg->rc32mPower << 17) |
              (powerCfg->xtalPower << 14) |
              (powerCfg->allPower << 13) |
              (powerCfg->isoPower << 11) |
              (powerCfg->bzPower << 10) |
              (powerCfg->sramDisStanby << 9) |
              (powerCfg->cgPower << 8) |
              (powerCfg->cpu1Power << 7) |
              (powerCfg->usbPower << 3);
    // pdsCtl = BL_SET_REG_BITS_VAL(pdsCtl, PDS_CR_PDS_LDO_VOL, normalCfg->vddcoreVol);
    pdsCtl |= (normalCfg->vddcoreVolEn << 18) |
              (normalCfg->cpu0NotNeedWFI << 21) |
              (normalCfg->cpu1NotNeedWFI << 20) |
              (normalCfg->busReset << 16) |
              (normalCfg->disIrqWakeUp << 15) |
              (normalCfg->powerOffXtalForever << 2) |
              (normalCfg->sleepForever << 1);
    BL_WR_REG(PDS_BASE, PDS_CTL, pdsCtl);

    pdsCtl = BL_RD_REG(PDS_BASE, PDS_CTL);

    if (enable) {
        pdsCtl |= (1 << 0);
    } else {
        pdsCtl &= ~(1 << 0);
    }

    BL_WR_REG(PDS_BASE, PDS_CTL, pdsCtl);
}
#endif

/****************************************************************************/ /**
 * @brief  PDS force turn off XXX domain
 *
 * @param  domain: PDS domain
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION PDS_Manual_Force_Turn_Off(PDS_FORCE_Type domain)
{
    uint32_t tmpVal = 0;

    /* memory sleep */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal |= 1 << (domain + PDS_FORCE_MEM_STBY_OFFSET);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* gate clock */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal |= 1 << (domain + PDS_FORCE_GATE_CLK_OFFSET);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* pds reset */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal |= 1 << (domain + PDS_FORCE_PDS_RST_OFFSET);
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* isolation on */
    // tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    // tmpVal |= 1 << (domain + PDS_FORCE_ISO_EN_OFFSET);
    // BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* power off */
    // tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    // tmpVal |= 1 << (domain + PDS_FORCE_PWR_OFF_OFFSET);
    // BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);
}
#endif

/****************************************************************************/ /**
 * @brief  PDS force turn on XXX domain
 *
 * @param  domain: PDS domain
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION PDS_Manual_Force_Turn_On(PDS_FORCE_Type domain)
{
    uint32_t tmpVal = 0;

    /* power on */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal &= ~(1 << (domain + PDS_FORCE_PWR_OFF_OFFSET));
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* isolation off */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal &= ~(1 << (domain + PDS_FORCE_ISO_EN_OFFSET));
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* pds de_reset */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal &= ~(1 << (domain + PDS_FORCE_PDS_RST_OFFSET));
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* memory active */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal &= ~(1 << (domain + PDS_FORCE_MEM_STBY_OFFSET));
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);

    /* clock on */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_CTL2);
    tmpVal &= ~(1 << (domain + PDS_FORCE_GATE_CLK_OFFSET));
    BL_WR_REG(PDS_BASE, PDS_CTL2, tmpVal);
}
#endif

/**
 * @brief
 *
 * @param col_size
 * @param row_size
 *
 * @return BL_Err_Type
 */
BL_Err_Type PDS_Set_KYD_Matrix_Size(uint8_t col_size, uint8_t row_size)
{
    uint32_t tmpVal = 0;

    /* set col size */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_KYD_COL_MATRIX_SIZE, col_size);
    BL_WR_REG(PDS_BASE, PDS_KYD_CTL, tmpVal);

    /* set row size */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_KYD_ROW_MATRIX_SIZE, row_size);
    BL_WR_REG(PDS_BASE, PDS_KYD_CTL, tmpVal);

    return SUCCESS;
}
/**
 * @brief
 *
 * @param val
 * @return BL_Err_Type
 */
BL_Err_Type PDS_Set_KYD_Col_Value(uint8_t val)
{
    uint32_t tmpVal = 0;

    /* set col output value */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_KYD_COL_O_VAL, val);
    BL_WR_REG(PDS_BASE, PDS_KYD_CTL, tmpVal);

    return SUCCESS;
}

/**
 * @brief
 *
 * @param en
 * @return BL_Err_Type
 */
BL_Err_Type PDS_Set_KYD_Row_Pull(uint8_t en)
{
    uint32_t tmpVal = 0;

