bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_pds.c
    /* disable/enable pullup or pulldown */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_KYD_ROW_I_PULL_EN, en);
    BL_WR_REG(PDS_BASE, PDS_KYD_CTL, tmpVal);

    return SUCCESS;
}

/**
 * @brief
 *
 * @param en
 * @return BL_Err_Type
 */
BL_Err_Type PDS_Set_KYD_Wakeup_En(uint8_t en)
{
    uint32_t tmpVal = 0;

    /* disable/enable cr_pds_kyd_en  */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_CR_PDS_KYD_EN, en);
    BL_WR_REG(PDS_BASE, PDS_KYD_CTL, tmpVal);

    PDS_Wakeup_Src_En(PDS_WAKEUP_SRC_KYD_WAKEUP, en);

    return SUCCESS;
}

/**
 * @brief PDS Clear KYD Wakeup Flag
 *
 * @return BL_Err_Type
 */
__WEAK
BL_Err_Type PDS_Clear_KYD_Wakeup(void)
{
    uint32_t tmpVal = 0;

    /* disable/enable cr_pds_kyd_en  */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_CLR_PDS_KYD_WAKEUP);
    BL_WR_REG(PDS_BASE, PDS_KYD_CTL, tmpVal);

    return SUCCESS;
}

/**
 * @brief set gpio x binding to keyscan row input lines
 *
 * @param row_x
 * @param sel_io
 * @return BL_Err_Type
 */
BL_Err_Type PDS_Set_KYS_ROW_IN_GPIO(PDS_KEY_ROW_Type row_x, PDS_KYS_GPIO_Type sel_io)
{
    CHECK_PARAM(IS_PDS_KYS_ROW_TYPE(row_x));
    CHECK_PARAM(IS_PDS_KYS_GPIO_TYPE(sel_io));

    uint32_t tmp_val = 0;
    /* select  gpio x binding to keyscan row input lines. */
    switch (row_x) {
        case PDS_KEY_ROW_0:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_0_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_ROW_1:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_1_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_ROW_2:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_2_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_ROW_3:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_3_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_ROW_4:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_4_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1, tmp_val);
            break;
        case PDS_KEY_ROW_5:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_5_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1, tmp_val);
            break;
        case PDS_KEY_ROW_6:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_6_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1, tmp_val);
            break;
        case PDS_KEY_ROW_7:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_ROW_I_7_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_ROW_I_GPIO_SEL1, tmp_val);
            break;

        default:
            break;
    }
    return SUCCESS;
}

/**
 * @brief select gpio x binding to keyscan col output lines
 *
 * @param col_x
 * @param sel_io
 * @return BL_Err_Type
 */
BL_Err_Type PDS_Set_KYS_COL_OUT_GPIO(PDS_KEY_COL_Type col_x, PDS_KYS_GPIO_Type sel_io)
{
    CHECK_PARAM(IS_PDS_KYS_COL_TYPE(col_x));
    CHECK_PARAM(IS_PDS_KYS_GPIO_TYPE(sel_io));

    uint32_t tmp_val = 0;
    /* select  gpio x binding to keyscan col output lines. */

    switch (col_x) {
        case PDS_KEY_COL_0:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_0_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_COL_1:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_1_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_COL_2:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_2_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_COL_3:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_3_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL0, tmp_val);
            break;
        case PDS_KEY_COL_4:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_4_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1, tmp_val);
            break;
        case PDS_KEY_COL_5:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_5_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1, tmp_val);
            break;
        case PDS_KEY_COL_6:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_6_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1, tmp_val);
            break;
        case PDS_KEY_COL_7:
            tmp_val = BL_RD_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1);
            tmp_val = BL_SET_REG_BITS_VAL(tmp_val, PDS_CFG_KEY_COL_O_7_GPIO_SEL, sel_io);
            BL_WR_REG(PDS_BASE, PDS_KYS_COL_O_GPIO_SEL1, tmp_val);
            break;

        default:
            break;
    }
    return SUCCESS;
}

/**
 * @brief PDS Get KYS Wakeup by col output and gpio x
 *
 * @param row_index
 * @param row_gpio
 * @return BL_Err_Type
 */
__WEAK
BL_Err_Type PDS_Get_KYS_Wakeup_ROW_INDEX_GPIO(PDS_KEY_ROW_Type* row_index,PDS_KYS_GPIO_Type* row_gpio)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    *row_index = BL_GET_REG_BITS_VAL(tmpVal, PDS_RO_PDS_KYD_WAKEUP_ROW_INDEX);
    *row_gpio = BL_GET_REG_BITS_VAL(tmpVal, PDS_RO_PDS_KYD_WAKEUP_ROW_GPIO);

    return SUCCESS;
}

/**
 * @brief PDS Get KYS Wakeup by row input lines and gpio x
 *
 * @param col_index
 * @param col_gpio
 * @return BL_Err_Type
 */
__WEAK
BL_Err_Type PDS_Get_KYS_Wakeup_COL_INDEX_GPIO(PDS_KEY_COL_Type* col_index,PDS_KYS_GPIO_Type* col_gpio)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_CTL);
    *col_index = BL_GET_REG_BITS_VAL(tmpVal, PDS_RO_PDS_KYD_WAKEUP_COL_INDEX);
    *col_gpio = BL_GET_REG_BITS_VAL(tmpVal, PDS_RO_PDS_KYD_WAKEUP_COL_GPIO);

    return SUCCESS;
}

/**
 * @brief PDS Set KYS White_Key
 *
 * @param white_key_i
 * @param row_index
 * @param col_index
 * @param type
 * @return BL_Err_Type
 */
__WEAK
BL_Err_Type PDS_Set_KYS_White_Key(uint8_t white_key_i ,PDS_KEY_ROW_Type row_index,PDS_KEY_COL_Type col_index,PDS_KYD_WHITE_KEY_MODE_Type type)
{
    if( white_key_i > 3 ) {
        return ERROR;
    }

