bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_pds.c
    uint32_t tmpVal = 0;
    uint8_t bits_offset = 0;
    bits_offset = 8 * white_key_i;

    tmpVal = BL_RD_REG(PDS_BASE, PDS_KYD_WHITE_SET);

    tmpVal &= ~(0xF << bits_offset );
    tmpVal |= (row_index << bits_offset );
    tmpVal |= (col_index << (3 + bits_offset));
    tmpVal |= (type << (6 + bits_offset));

    BL_WR_REG(PDS_BASE, PDS_KYD_WHITE_SET, tmpVal);

    return SUCCESS;
}
/****************************************************************************/ /**
 * @brief  Install PDS interrupt callback function
 *
 * @param  intType: PDS int type
 * @param  cbFun: cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
BL_Err_Type PDS_Int_Callback_Install(PDS_INT_Type intType, intCallback_Type *cbFun)
{
#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(PDS_WAKEUP_IRQn, PDS_WAKEUP_IRQHandler);
#endif
    pdsIntCbfArra[intType] = cbFun;

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Power down sleep wake up interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void PDS_WAKEUP_IRQHandler(void)
{
    for (PDS_INT_Type intType = PDS_INT_WAKEUP; intType < PDS_INT_MAX; intType++) {
        if (PDS_Get_IntStatus(intType) && (pdsIntCbfArra[intType] != NULL)) {
            pdsIntCbfArra[intType]();
        }
    }

    PDS_IntClear();
}
#endif

/*@} end of group PDS_Public_Functions */

/*@} end of group PDS */

/*@} end of group BL702L_Peripheral_Driver */
